# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [2]:
#Your code here
import pandas as pd
import sqlite3
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Display the names of all the employees in Boston.

In [3]:
#Your code here
cur.execute('''SELECT e.firstName, e.lastName 
            FROM employees e
            JOIN offices o
            USING (officeCode)
            WHERE o.city = 'Boston';
            ''').fetchall()

[('Julie', 'Firrelli'), ('Steve', 'Patterson')]

## Do any offices have no employees?

In [7]:
#Your code here
result = cur.execute('''
            SELECT employees.employeeNumber, offices.city, offices.state 
            FROM offices
            LEFT OUTER JOIN employees
            USING (officeCode)
            ''').fetchall()
pd.DataFrame(list(result))

       0              1           2
0   1002  San Francisco          CA
1   1056  San Francisco          CA
2   1076  San Francisco          CA
3   1143  San Francisco          CA
4   1165  San Francisco          CA
5   1166  San Francisco          CA
6   1188         Boston          MA
7   1216         Boston          MA
8   1286            NYC          NY
9   1323            NYC          NY
10  1102          Paris
11  1337          Paris
12  1370          Paris
13  1401          Paris
14  1702          Paris
15  1621          Tokyo  Chiyoda-Ku
16  1625          Tokyo  Chiyoda-Ku
17  1088         Sydney
18  1611         Sydney
19  1612         Sydney
20  1619         Sydney
21  1501         London
22  1504         London

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary

In [ ]:
# Your code here

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of each product each employee has sold.

In [ ]:
# Your code here

## Level Up: Display the Number of Products each Employee Has sold

In [ ]:
#Your code here

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!